init.org
#+TITLE: Emacs Config
:PROPERTIES:
#+PROPERTY: header-args :results silent  :tangle ./init.el
:END:

* TODO for configs [0/5]
** TODO Try out dap-mode
** TODO Try org-fc
** TODO Setup iedit
** TODO Fix Dired Keymaps



* Early Init File
** Optimizations

Garbage Collections along with the package gcmh and setting up file specific commands.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  ;; Minimize garbage collection during startup
  (setq gc-cons-threshold most-positive-fixnum)

  ;; Lower threshold back to 8 MiB (default is 800kB)
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold 100000000)))

#+END_SRC

Removing wayland input lags.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq-default pgtk-wait-for-event-timeout 0)

#+END_SRC

Disable resizing in order preserve no of columns and lines in display.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  
  (setq frame-inhibit-implied-resize t) ;; Supposed to hasten startup
#+END_SRC

Idle time delay before updating various things on the screen.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq idle-update-delay 1.0)

#+END_SRC

Explicitly define a width to reduce the cost of on-the-fly computation

#+BEGIN_SRC emacs-lisp  :tangle ./early-init.el

  (setq-default display-line-numbers-width 3)

#+END_SRC

Disabling bidi (bidirectional editing stuff).

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  
  (setq-default bidi-display-reordering 'left-to-right 
                bidi-paragraph-direction 'left-to-right)
#+END_SRC

Accelerate scrolling.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq fast-but-imprecise-scrolling t)

#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  ;; In noninteractive sessions, prioritize non-byte-compiled source files to
  ;; prevent the use of stale byte-code. Otherwise, it saves us a little IO time
  ;; to skip the mtime checks on every *.elc file.
  (setq-default load-prefer-newer noninteractive)

#+END_SRC

** Elpaca Init

#+BEGIN_SRC emacs-lisp

  (setq package-enable-at-startup nil)

#+END_SRC

** Emacs UI

Remove modeline.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq-default mode-line-format nil)
#+END_SRC

No cursor in inactive windows.
	
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq-default cursor-in-non-selected-windows nil)
#+END_SRC

No start up screen.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq inhibit-startup-screen t)
#+END_SRC

No echo area message during startup.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq inhibit-startup-echo-area-message t)
#+END_SRC

No message in scratch buffer
	
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq initial-scratch-message nil)
#+END_SRC

No Initial buffer, i.e. make initial buffer the scratch buffer.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq initial-buffer-choice nil)
#+END_SRC

No title frame.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq frame-title-format nil)
#+END_SRC

No scroll bars.
	
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (if (fboundp 'scroll-bar-mode) (set-scroll-bar-mode nil))
#+END_SRC

No toolbars at all.
	
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
#+END_SRC

No menu bar.
	
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (menu-bar-mode -1)
#+END_SRC

No limit on font lock. (tree style levels)

#+BEGIN_SRC emacs-lisp:tangle ./early-init.el

	(setq-default font-lock-maximum-size nil)
#+END_SRC

No Blinking cursor.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (blink-cursor-mode -1)
#+END_SRC

Display line numbers globally

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (global-display-line-numbers-mode t)
#+END_SRC

Then disable them for a few modes.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (dolist (mode '(org-mode-hook org-agenda-mode term-mode-hook dired-mode-hook shell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+END_SRC

Enable lines being truncated.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (set-default 'truncate-lines t)
#+END_SRC

Disable most messages in echo area. Doesnt work if enabled before starting the GUI.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq-default inhibit-message nil)

#+END_SRC

Setting some default frame settings. For border and cursors.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (add-to-list 'default-frame-alist '(internal-border-width . 10 ))
  (add-to-list 'default-frame-alist '(internal-show-cursor . -1))

#+END_SRC

Replace the truncation symbols for file buffers with truncation enabled. (Doesn't work for org-mode)

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (set-display-table-slot standard-display-table 0 ?\ ) 

#+END_SRC

Disable the line break symbols in fringes.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setf (cdr (assq 'continuation fringe-indicator-alist)) '(nil nil))

#+END_SRC

To disable buttons for checkboxes

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq-default widget-image-enable nil)

#+END_SRC

*** Suppressing Messages
**** Suppress EOB and BOBs

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (defun my-command-error-function (data context caller)
    "Ignore the buffer-read-only, beginning-of-buffer,
   end-of-buffer signals; pass the rest to the default handler."
    (when (not (memq (car data) '(buffer-read-only
                                  beginning-of-buffer
                                  end-of-buffer)))
      (command-error-default-function data context caller)))

  (setq command-error-function #'my-command-error-function)
#+END_SRC

**** Suppress on Events

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (defun suppress-message-advice-around (fun &rest args)
    (let (message-log-max)
      (with-temp-message (or (current-message) "")
        (apply fun args))))

  ;; example: suppress any messages from `save-buffer'
  (advice-add 'save-buffer :around 'suppress-message-advice-around)
  (advice-add 'kill-buffer :around 'suppress-message-advice-around)

  ;; Disable echoing keystrokes
  (setq-default echo-keystrokes 0.025)

  ;; Disable Evil Modes information
  (setq-default evil-echo-state nil)
#+END_SRC


* Warnings

List of warnings that the byte-compiler should issue. 

#+BEGIN_SRC emacs-lisp

  ;; (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
  (setq byte-compile-warnings 'nil)

#+END_SRC

Silence compiler warnings as they can be pretty disruptive.

#+BEGIN_SRC emacs-lisp
  
  (if (boundp 'comp-deferred-compilation)
      (setq-default comp-deferred-compilation nil)
    (setq-default native-comp-deferred-compilation nil))

  (setq-default native-comp-async-report-warnings-errors nil)

  ;; Display Minimum warnings
  (setq-default warning-minimum-level :emergency)

#+END_SRC

* Sane Defaults

#+BEGIN_SRC emacs-lisp 

  (setq-default
   ad-redefinition-action 'accept                  ; Silence warnings for redefinition
   delete-by-moving-to-trash t                     ; Delete files to trash
   help-window-select t                            ; Focus new help windows when opened
   mouse-yank-at-point t                           ; Yank at point rather than cursor
   scroll-conservatively most-positive-fixnum      ; Always scroll by one line
   select-enable-clipboard t                       ; Merge system's and Emacs' clipboard
   show-trailing-whitespace nil                    ; Do not display trailing whitespaces
   tab-width 2                                     ; Set width for tabs
   uniquify-buffer-name-style 'forward             ; Uniquify buffer names
   ring-bell-function 'ignore                      ; Be quiet!
   custom-file (locate-user-emacs-file "custom-vars.el")    ; Move customization variables to a separate file and load it
   confirm-kill-processes nil
   sentence-end-double-space nil               ; a sentence ends with only one space
   scroll-step 1                               ; Line wise scroll.
   scroll-conservatively 101                   ; Whether to recenter cursor on scroll. If the value is greater than 100, it wont.
   indent-tabs-mode nil
   tab-always-indent 't
   tab-width 2
   )                   

  (load custom-file 'noerror 'nomessage)
  (fset 'yes-or-no-p 'y-or-n-p)                      ; Replace yes/no prompts with y/n
  (recentf-mode 1)                                   ; Remember recently opened files
  (save-place-mode 1)                                ; Remember the last traversed point in file
  (global-auto-revert-mode 1)                        ; Automatically revert buffers when the underlying file is changed
  (setq global-auto-revert-non-file-buffers t)       ; Auto revert other non file buffers too

  ;; Run at full power please
  (put 'downcase-region 'disabled nil)
  (put 'upcase-region 'disabled nil)
  (put 'narrow-to-region 'disabled nil) 
  (put 'dired-find-alternate-file 'disabled nil)     ; Open dired in same buffer

#+END_SRC

* Custom Tokens
** Variables

#+BEGIN_SRC emacs-lisp
  (defvar bgcolor "#11111b"
    "The normal background of emacs.")
  (defvar grim-bgcolor "#14141f"
    "The darker background of emacs.")
  (defvar dim-bgcolor "#1e1e2e"
    "The darker background of emacs.")
  (defvar darker-bgcolor "#0D0D15"
    "The darker background of emacs.")
  (defvar darkest-bgcolor "#0B0B11"
    "The darker background of emacs.")
  (defvar dim-fgcolor "#6C7096"
    "The calm foreground of emacs.")
  (defvar calm-fgcolor "#BAC2DE"
    "The calm foreground of emacs.")
  (defvar mauve-color "#cba6f7"
    "The blue color for emacs.")
  (defvar lavender-color "#b4befe"
    "The blue color for emacs.")
  (defvar blue-color "#90b6f3"
    "The blue color for emacs.")
  (defvar pink-color "#cba6f7"
    "The pink color for emacs.")
  (defvar red-color "#f38ba8"
    "The red color for emacs.")
  (defvar orange-color "#fab387"
    "The red color for emacs.")
  (defvar teal-color "#a6e3a1"
    "The pink color for emacs.")
  (defvar grim-fgcolor "#232338"
    "The calm foreground of emacs.")

#+END_SRC

** Faces

#+BEGIN_SRC emacs-lisp

  (defface minibuffer-face
    '((t :font "Barlow SemiCondensed SemiBold"
         :height 170
         :foreground "#BAC2DE"
         ))
    "Face for minibuffer."
    :group 'minibuffer )

#+END_SRC

