init.org
** Functions
Delete window or frame accordingly to prevent the =Attempt to delete a...= message.

#+BEGIN_SRC emacs-lisp

  (defun delete-window-or-frame (&optional window frame force)
    (interactive)
    (if (= 1 (length (window-list frame)))
        (delete-frame frame force)
      (delete-window window)))
#+END_SRC

The ~CTRL-L~ function.

#+BEGIN_SRC emacs-lisp
  (defun clear ()
    (interactive)
    (evil-ex-nohighlight)
    (iedit--quit)
    ;; (redraw-display)
    (posframe-hide-all)
    ;; (evil-mc-undo-all-cursors)
    (evil-force-normal-state)
    )
#+END_SRC

To prevent the evil escape key from impacting the visual mode.

#+BEGIN_SRC emacs-lisp
  
  (defun configure-evil-ins ()
    "Default evil ins key"
    (evil-escape-mode 1))
  (add-hook 'evil-insert-state-entry-hook #'configure-evil-ins)
  (add-hook 'minibuffer-mode-hook #'(lambda () (interactive) (evil-escape-mode 1) ))

  (defun configure-evil-exit-ins ()
    "Default evil ins key"
    (evil-escape-mode -1))
  (add-hook 'evil-visual-state-entry-hook #'configure-evil-exit-ins)
#+END_SRC

Cleaner buffer traversal.

#+BEGIN_SRC emacs-lisp

  (defcustom my-skippable-buffer-regexp
    (rx bos (or "*Messages*" "*scratch*" "*Help*") eos)
    "Matching buffer names are ignored by `my-next-buffer'
    and `my-previous-buffer'."
    :type 'regexp)

  (defun my-change-buffer (change-buffer)
    "Call CHANGE-BUFFER until `my-skippable-buffer-regexp' doesn't match."
    (let ((initial (current-buffer)))
      (funcall change-buffer)
      (let ((first-change (current-buffer)))
        (catch 'loop
          (while (string-match-p my-skippable-buffer-regexp (buffer-name))
            (funcall change-buffer)
            (when (eq (current-buffer) first-change)
              (switch-to-buffer initial)
              (throw 'loop t)))))))

  (setq my-skippable-buffer-regexp
        (rx bos (or (or "*Messages*" "*scratch*" "*Help*")
                    (seq "*" (zero-or-more anything)))
            eos))

  (defun my-next-buffer ()
    "Variant of `next-buffer' that skips `my-skippable-buffer-regexp'."
    (interactive)
    (my-change-buffer 'next-buffer))

  (defun my-previous-buffer ()
    "Variant of `previous-buffer' that skips `my-skippable-buffer-regexp'."
    (interactive)
    (my-change-buffer 'previous-buffer))

#+END_SRC

Other interesting functions.

#+BEGIN_SRC emacs-lisp

  (defun open-current-file-in-vim ()
    (interactive)
    (async-shell-command
     (format "foot nvim +%d %s"
             (+ (if (bolp) 1 0) (count-lines 1 (point)))
             (shell-quote-argument buffer-file-name))))

  (defun compile-latex-doc ()
    (interactive)
    (save-window-excursion
      (shell-command
       (format "pdflatex %s"
               (shell-quote-argument buffer-file-name)))

      ))

  (defun rename-current-buffer-file ()
    "Renames current buffer and file it is visiting."
    (interactive)
    (let* ((name (buffer-name))
           (filename (buffer-file-name)))
      (if (not (and filename (file-exists-p filename)))
          (error "Buffer '%s' is not visiting a file!" name)
        (let* ((dir (file-name-directory filename))
               (new-name (read-file-name "New name: " dir)))
          (cond ((get-buffer new-name)
                 (error "A buffer named '%s' already exists!" new-name))
                (t
                 (let ((dir (file-name-directory new-name)))
                   (when (and (not (file-exists-p dir)) (yes-or-no-p (format "Create directory '%s'?" dir)))
                     (make-directory dir t)))
                 (rename-file filename new-name 1)
                 (rename-buffer new-name)
                 (set-visited-file-name new-name)
                 (set-buffer-modified-p nil)
                 (when (fboundp 'recentf-add-file)
                   (recentf-add-file new-name)
                   (recentf-remove-if-non-kept filename))
                 (message "File '%s' successfully renamed to '%s'" name (file-name-nondirectory new-name))))))))

  (defun google-this ()
    "Google the selected region if any, display a query prompt otherwise."
    (interactive)
    (browse-url
     (concat
      "http://www.google.com/search?ie=utf-8&oe=utf-8&q="
      (url-hexify-string (if mark-active
                             (buffer-substring (region-beginning) (region-end))
                           (read-string "Google: "))))))

  (defun org-schedule-tomorrow ()
    "Org Schedule for tomorrow (+1d)."
    (interactive)
    (org-schedule t "+1d"))
#+END_SRC

* Emacs File Managements
** Manage backups
Keep all backups in ~tmp/backups/~ instead of cluttering the file system.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  
  ;; File syntax: DEMO.el~
  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))
#+end_src

** Manage Autosaves
Keep all autosaves in ~tmp/auto-saves/~ for the same reason.
	
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  
  ;; File syntax #DEMO.el#

  ;; auto-save-mode doesn't create the path automatically!
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)

  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory) ; prefix for generating autosave list file name
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))
#+end_src
	
** Creating Lockfiles =DISABLED=
Preventing lock files from being created. The ~create-lockfiles~ option is used to protect file from being edited by another emacs session while its unsaved
	
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  
  ;; For #DEMO.el
  ;; (setq create-lockfiles nil)
#+END_SRC

** User Directory
The default directory to store packages and other files related to emacs.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq user-emacs-directory (expand-file-name "~/.cache/emacs"))
#+END_SRC

** Recentf
Directory to store the recent files list.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el

  (setq-default recentf-save-file "~/.cache/emacs/recentf")
#+END_SRC

* Default Paths

#+BEGIN_SRC emacs-lisp

  (add-to-list 'load-path "~/.config/emacs/packages/")
#+END_SRC

* Plugins
** Elpaca Plugin Manager

#+BEGIN_SRC emacs-lisp

  (require 'elpaca-setup)
#+END_SRC

** Orderless

#+begin_src emacs-lisp

  ;; Optionally use the `orderless' completion style.
  (use-package orderless
    :init
    ;; Configure a custom style dispatcher (see the Consult wiki)
    ;; (setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)
    ;;       orderless-component-separator #'orderless-escapable-split-on-space)
    (setq completion-styles '(orderless basic)
          completion-category-defaults nil
          completion-cycle-threshold 0
          completion-category-overrides '((file (styles partial-completion)))))
#+END_SRC

** Devdocs

#+begin_src emacs-lisp

  (use-package devdocs)
#+end_src

** Catppuccin

#+BEGIN_SRC emacs-lisp

  (use-package catppuccin-theme
    :config
    (setq catppuccin-flavor 'mocha) ;; or 'latte, 'macchiato, or 'mocha
    (load-theme 'catppuccin :no-confirm)

    ;; Customization
    (catppuccin-set-color 'rosewater "#f5e0dc")
    (catppuccin-set-color 'flamingo "#f2cdcd")
    (catppuccin-set-color 'pink "#f5c2e7")
    (catppuccin-set-color 'mauve "#cba6f7")
    (catppuccin-set-color 'red "#f38ba8")
    (catppuccin-set-color 'maroon "#eba0ac")
    (catppuccin-set-color 'peach "#fab387")
    (catppuccin-set-color 'yellow "#f9e2af")
    (catppuccin-set-color 'green "#a6e3a1")
    (catppuccin-set-color 'teal "#94e2d5")
    (catppuccin-set-color 'sky "#89dceb")
    (catppuccin-set-color 'sapphire "#74c7ec")
    (catppuccin-set-color 'blue "#89b4fa")
    (catppuccin-set-color 'lavender "#b4befe")
    (catppuccin-set-color 'text "#cdd6f4")
    (catppuccin-set-color 'subtext1 "#bac2de")
    (catppuccin-set-color 'subtext0 "#a6adc8")
    (catppuccin-set-color 'overlay2 "#9399b2")
    (catppuccin-set-color 'overlay1 "#7f849c")
    (catppuccin-set-color 'overlay0 "#6c7086")
    (catppuccin-set-color 'surface2 "#585b70")
    (catppuccin-set-color 'surface1 "#45475a")
    (catppuccin-set-color 'surface0 "#313244")
    (catppuccin-set-color 'mantle "#0E0E16")
    (catppuccin-set-color 'crust "#0B0B11")
    (catppuccin-set-color 'base "#11111B")

    (catppuccin-reload)
    )
#+END_SRC

** LaTeX
#+begin_src emacs-lisp 

  (use-package math-symbols)
  (package-install 'auctex)
  ;; (use-package latex-preview-pane
  ;;   :init
  ;;   (setq message-latex-preview-pane-welcome " \n\n\n ")
  ;;   (setq latex-preview-pane-use-frame 't)
  ;;   (setq doc-view-resolution 200)
  ;;   (setq doc-view-continuous 't)
  ;;   (setq doc-view-svg-background bgcolor)
  ;;   (setq doc-view-svg-foreground calm-fgcolor)
  ;;   :hook
  ;;   (latex-mode)
  ;;   )
#+end_src
  
** Corfu
*** Config

#+begin_src emacs-lisp

  (use-package corfu
    :init
    (global-corfu-mode)
    :custom
    (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    (corfu-separator ?\s)          ;; Orderless field separator
    (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
    (corfu-quit-no-match t)      ;; Never quit, even if there is no match
    (corfu-preview-current nil)    ;; Disable current candidate preview
    (corfu-preselect 'first)      ;; Preselect the prompt
    (corfu-on-exact-match nil)     ;; Configure handling of exact matches
    (corfu-scroll-margin 5)        ;; Use scroll margin
    (corfu-minimum-width 100)        ;; Use scroll margin
    (corfu-maximum-width 190)        ;; Use scroll margin
    (corfu-auto-prefix 1)
    (corfu-auto-delay 0.3)
    (corfu-popupinfo-delay '(2.0 . 1.0))

    :config
    (corfu-popupinfo-mode 1)
    (corfu-history-mode 1))

  (setq corfu--frame-parameters '((no-accept-focus . t)
                                  (no-focus-on-map . t)
                                  (min-width . t)
                                  (min-height . t)
                                  (border-width . 0)
                                  (child-frame-border-width . 10)
                                  (left-fringe . 0)
                                  (right-fringe . 0)
                                  (vertical-scroll-bars)
                                  (horizontal-scroll-bars)
                                  (menu-bar-lines . 0)
                                  (tool-bar-lines . 0)
                                  (tab-bar-lines . 0)
                                  (no-other-frame . t)
                                  (unsplittable . t)
                                  (undecorated . t)
                                  (cursor-type)
                                  (no-special-glyphs . t)
                                  (desktop-dont-save . t)))

#+end_src

*** Cape

#+begin_src emacs-lisp

  ;; Add extensions
  (use-package cape
    :init
    ;; Add `completion-at-point-functions', used by `completion-at-point'.
    ;; (add-to-list 'completion-at-point-functions #'cape-dabbrev 5)
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-history)
    ;; (add-to-list 'completion-at-point-functions #'cape-keyword)
    ;; (add-to-list 'completion-at-point-functions #'cape-elisp-symbol)
    (add-to-list 'completion-at-point-functions #'cape-elisp-block)
    ;; (add-to-list 'completion-at-point-functions #'cape-line)
    )

#+end_src

*** Yasnippet Capf

#+begin_src emacs-lisp 

  (use-package yasnippet-capf
    :after cape
    :config
    ;; (setq yasnippet-capf-lookup-by 'name) ;; Prefer the name of the snippet instead
    (add-to-list 'completion-at-point-functions #'yasnippet-capf))
#+end_src

** Posframe

#+begin_src emacs-lisp
  (use-package posframe)
#+end_src

** Popper

#+begin_src emacs-lisp
  (use-package popper
    :init
    (setq popper-reference-buffers
          '("\\*Messages\\*"
            "\\*gud-test\\*"
            "Output\\*$"
            "\\*Warnings\\*"
            help-mode
            compilation-mode))
    (popper-mode +1))
#+end_src

** Evil
*** Evil
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :init
    (setq evil-undo-system 'undo-fu)
    (setq evil-want-C-i-jump nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-d-scroll t)
    (setq evil-want-fine-undo t)
    (setq evil-want-Y-yank-to-eol t)

    ;; ----- Setting cursor colors
    (setq evil-emacs-state-cursor    '("#cba6f7" box))
    (setq evil-normal-state-cursor   '("#BAC2DE" box))
    (setq evil-operator-state-cursor '("#90b6f3" (bar . 6))) 
    (setq evil-visual-state-cursor   '("#6C7096" box))
    (setq evil-insert-state-cursor   '("#b4befe" (bar . 2)))
    (setq evil-replace-state-cursor  '("#eb998b" hbar))
    (setq evil-motion-state-cursor   '("#f38ba8" box))
    :config
    (evil-mode 1)
    ;; INITIAL BINDINGS
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal)
    (evil-define-key 'motion help-mode-map "q" 'kill-this-buffer)
    )

#+END_SRC

*** Evil Collection
#+BEGIN_SRC emacs-lisp

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+END_SRC

*** Evil Collection
#+BEGIN_SRC emacs-lisp

  (use-package evil-commentary
    :after evil)
#+END_SRC

*** Evil Escape
#+BEGIN_SRC emacs-lisp

  (use-package evil-escape
    :config
    (evil-escape-mode)
    :custom
    (evil-escape-key-sequence "jk")
    (evil-escape-delay 0.2))

#+END_SRC

*** Evil Surround
#+BEGIN_SRC emacs-lisp

  (use-package evil-surround
    :config
    (global-evil-surround-mode 1)
    :after evil)

#+END_SRC

** Undo/Redo

#+begin_src emacs-lisp

  (use-package undo-fu)
  (use-package undo-fu-session
    :config
    (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
    (undo-fu-session-global-mode))


#+end_src

** Helpful

#+begin_src emacs-lisp

  (use-package helpful
    :config
    (setq counsel-describe-function-function #'helpful-callable)
    (setq counsel-describe-variable-function #'helpful-variable))

#+end_src

** Evil Org

#+begin_src emacs-lisp

  (use-package evil-org
    :diminish evil-org-mode
    :after org
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys)
    (add-hook 'org-mode-hook 'evil-org-mode)
    (add-hook 'evil-org-mode-hook
              (lambda () (evil-org-set-key-theme))))

#+end_src

